export type Quote = {
	text: string;
	author: string;
};

export const quotes: Quote[] = [
	{
		text: "成就伟业的唯一途径是热爱自己的事业。",
		author: "史蒂夫·乔布斯",
	},
	{
		text: "努力不要成为一个成功的人，而要成为一个有价值的人。",
		author: "阿尔伯特·爱因斯坦",
	},
	{
		text: "未经审视的人生不值得过。",
		author: "苏格拉底",
	},
	{
		text: "你的时间有限，不要浪费时间过别人的生活。",
		author: "史蒂夫·乔布斯",
	},
	{
		text: "要得到你想要的某样东西，最好的办法是让你自己配得上它。这个世界还没疯狂到会奖励一群不配拥有它的人。",
		author: "查理·芒格",
	},
	{
		text: "在我的一生中，我从未见过哪个智慧的人不是无时无刻不在读书的——一个都没有，零。",
		author: "查理·芒格",
	},
	{
		text: "每天努力让自己比醒来时更聪明一点。",
		author: "查理·芒格",
	},
	{
		text: "生活是一种律动，须有光有影，有左有右，有晴有雨，趣味就在这变而不猛的曲折里，微微暗些，再明起来，则暗得有趣，而明乃更明。",
		author: "老舍",
	},
	{
		text: "不乱于心，不困于情。不畏将来，不念过往。如此，安好。",
		author: "丰子恺",
	},
	{
		text: "走运时，要想到倒霉，不要得意得过了头；倒霉时，要想到走运，不必垂头丧气。心态始终保持平衡，情绪始终保持稳定，此亦长寿之道。",
		author: "季羡林",
	},
	{
		text: "不要温和地走进那个良夜，老年应当在日暮时燃烧咆哮；怒斥，怒斥光明的消逝。",
		author: "狄兰·托马斯",
	},
	{
		text: "记住你终将死去，是我所知避免陷入患得患失困境的最佳方法。你已经一丝不挂了，没有理由不追随你的内心。",
		author: "史蒂夫·乔布斯",
	},
	{
		text: "当我开始真正爱自己，我不再牺牲自己的自由时间，不再去勾画什么宏伟的明天。今天我只做有趣和快乐的事，做自己热爱，让心欢喜的事，用我的方式，以我的韵律。",
		author: "卓别林",
	},
	{
		text: "在命运为你安排的属于自己的时区里，一切都准时。",
		author: "佚名",
	},
	{
		text: "成为一个自爱的人，学会自我肯定、自我接纳、自我愉悦，是一道人生要做的功课。",
		author: "佚名",
	},
];
