{"2025-year-end-summary":{"words":1504,"minutes":8,"excerpt":"今年的我，并没有突然变得更厉害。 更多时候，是一点点把日子重新摆好：把情绪放进歌里，把经验写成方法，把工具收进工作流，把想做的事拆成可以每天推进的一小步。 写作在 2025 年继续扮演同一个角色——它不是“成果展示”，而是一种自我整理。 一年写作速览（轻统计） 全年共发布 53 篇文章 分类分布：音乐欣赏 21、生活随..."},"Steam2022":{"words":1004,"minutes":6,"excerpt":"一、为什么要转区 主要原因当然是节省成本和游玩更多的游戏，先说节省成本，和奈飞（Netflix）等流媒体的付费逻辑一样，更欠发达地区的付费金额会比发达地区要少一些，可以用更低的价格买到更多的游戏，谁还不是一个阿根廷人了？（笑 Steam上的游戏能在全世界范围内发行销售，但是由于各地政府都有不同的审核限制条件，部分游戏为..."},"ai1":{"words":2394,"minutes":12,"excerpt":"一、OpenAI与ChatGPT 1.1 介绍ChatGPT ChatGPT（Chat Generative Pre-trained Transformer，基于转换器的交互式生成式预训练模型），是由OpenAI开发的一个人工智能聊天机器人程序，于2022年11月推出。该程序使用基于GPT-3.5架构的大型语言模型并通..."},"ai2":{"words":659,"minutes":4,"excerpt":"OpenAI已经将模型的能力推向了一个极度易用的程度，多模态的结合使我原本需要在脑海或物理上进行的整合工作减少了。下一步，我将基于自己的工作流，抽象出需要完成的任务的能力，制作成定制的GPTs，这将极大地扩展我们的能力边界。 通用场景的魅力 使用ChatGPT时，我被其通用性所吸引，它能帮我完成各种任务。这种通用性的优..."},"ai3":{"words":1505,"minutes":8,"excerpt":"由于OpenAI服务不稳定，我打算不再续费。我将寻找其它替代产品，例如，用NotionAI处理文档，用GitHub Copilot写代码，对于一些翻译和文本处理工作，我选择Ollama。 Ollama 本地大模型 Ollama是一个开源框架，用于在本地运行大型语言模型（LLM）。它为开发人员和研究人员提供了一个集成的平..."},"ai4":{"words":1069,"minutes":6,"excerpt":"本文将带您深入了解Cherry Studio这款强大的AI桌面客户端，探索其如何通过MCP协议为大模型赋能。 前言 随着大语言模型技术的飞速发展，各种AI应用层出不穷。在尝试了众多AI工具后，最近我发现了一款名为Cherry Studio的桌面客户端，它支持多种LLM提供商，可在Windows、Mac和Linux上使用..."},"ai5":{"words":4247,"minutes":22,"excerpt":"在图像生成和编辑领域，开源模型终于迎来了重大突破！Black Forest Labs发布的FLUX.1 Kontext Dev为开发者和研究人员提供了媲美商业产品的图像编辑能力。 FLUX.1 Kontext Dev 简介 FLUX.1 Kontext Dev是由Black Forest Labs开发的突破性多模态图像..."},"ai6":{"words":968,"minutes":5,"excerpt":"在AI绘画领域，ComfyUI以其强大的节点化工作流而备受青睐，而一个好用的提示词工具更是能让创作效率倍增。 插件简介 ComfyUI提示词小助手（Prompt Assistant） 是一款专为ComfyUI设计的全能提示词插件，目前最新版本为 v1.1.0。这款插件集成了多种实用功能，能够显著提升AI绘画的工作效率。..."},"ai7-qwen-image-edit":{"words":1498,"minutes":8,"excerpt":"在图像编辑领域，Qwen 团队推出的 Qwen-Image-Edit 将强大的文本渲染与图像编辑能力结合在一起，为开发者提供了精确、稳定且高质量的编辑体验。q Qwen-Image-Edit 简介 Qwen-Image-Edit 基于 20B 规模的多模态基础模型能力演进而来，面向“图像编辑”场景进行了专项优化。它的核..."},"ai8-changes-my-creation":{"words":883,"minutes":5,"excerpt":"最近的日子，人工智能已经悄然融入了我的创作流程，从写作到游戏开发，它正在改变我思考和工作的方式。 写作方式的转变 以前写东西，总是对着空白的文档发呆，脑子里有想法却不知道从何下笔。那种\"万事开头难\"的感觉，相信很多人都体会过。 现在不一样了。我会先和 AI 对话，把脑海中零散的想法说出来，让它帮我生成一篇草稿。这个草稿..."},"ai9-gemini-creation-tool":{"words":1040,"minutes":6,"excerpt":"在众多 AI 工具中，我最终选择了 Google Gemini Pro，不仅因为它卓越的多模态能力，更因为它强大的图像生成功能。这些特性正在彻底改变我的创作方式，让想象力真正转化为现实。 为什么选择 Gemini 市面上的 AI 工具很多，ChatGPT、Claude、deepseek等等，每个都有自己的特色，但是今年..."},"blog1":{"words":957,"minutes":5,"excerpt":"前言 在2023年初，我决定更换博客的托管方式，想找一个更加方便的方式。由于我是Notion的重度用户，于是我找到了NotionNext。 首先介绍一下 NotionNext。它是一个使用 NextJS Notion API 实现的静态博客，支持多种部署方案。它无需服务器，搭建网站也非常容易。 我们将使用 Notion..."},"blog2":{"words":1019,"minutes":6,"excerpt":"缘由 前些天在x上有个热门话题，国内的语雀笔记服务中断，导致很多x友的笔记无法访问，工作被迫中断。这件事引起我的思考，我是Notion的重度用户，曾经也想着All in one 一个笔记系统，但是这件事情让我意识到，云端笔记系统的脆弱性，有极高的数据丢失和中断风险。 决定重新梳理和拆解我的笔记系统，把它分成两部分，一部..."},"book1":{"words":1270,"minutes":7,"excerpt":"《重来》是37signals的创始人制作的书籍，他在书中向我们阐述了另外一种生意运作模式，更简单，独立，并保持高营收的商业模型。这本书是我在读完《重来》之后，对这本书的一些感悟和思考。 《重来》一共有三部： 第一部和大家阐述独立运作的商业模式，保持小团队，创新的重要性。 第二部聊起了远程工作的探索，特别是在今年疫情期间..."},"book2":{"words":845,"minutes":5,"excerpt":">《美学的经济》是詹伟雄老师对美学、经济学和哲学等多个学科领域进行交叉思考后的一本探讨美学与经济关系的书籍。该书提出了\"美学的经济\"这一概念，认为美学是一种经济学上的资源，同时，美学也可以给经济学带来很多的启示和影响。 詹老师通过深入分析美学和经济学的基本原理和特点，探讨了它们之间的联系和交叉点，并结合大量的案例和实证..."},"design1":{"words":1178,"minutes":6,"excerpt":"在众多设计准则中，其中特别受广泛推崇的是迪特·拉姆斯（Dieter Rams）所定义的“好设计的10个原则（Ten principles for good design）”， 也即德国布劳恩公司优良设计十项原则。 1.Good design is innovative It does not copy existing..."},"design10":{"words":1182,"minutes":6,"excerpt":"ComfyUI 介绍 ComfyUI 是一个专为 Stable Diffusion 设计的基于节点的图形用户界面（GUI），旨在简化和优化图像生成过程。通过将整个图像生成过程分解为多个独立的节点，使用户能够灵活地构建和调整工作流。 每个节点执行特定的功能，如加载模型、输入文本提示、生成图像等。这种结构使得用户可以更好地..."},"design11":{"words":4017,"minutes":21,"excerpt":"前言 本文源自我长期以来在策略游戏项目中积累的经验与思考。作为一名热爱策略游戏的开发者，从《文明》、《帝国时代》、《群星》等经典作品中获取了诸多启发。在此，我将系统性地分享对策略游戏地图设计的见解，希望能为业内同行提供一些参考价值。 本文将从以下几个维度展开讨论: 地图设计与规划:包括瓦片选择、基础设定、区域规划和信息..."},"design12":{"words":1957,"minutes":10,"excerpt":"讨论无极缩放的设计 1、什么是无极缩放？ 无极缩放是一种镜头移动的机制，在手游《万国觉醒》上被应用而广为人知，玩家可通过手指的拖拽，镜头从微观视角一路上升到宏观视角，对策略游戏来说，是一种加分的设计机制。 使用了无极缩放设计的游戏，玩家能体验到无缝的摄像机切换，摄像机都架设在一个场景下，切换时没有场景加载动画，不会打断..."},"design2":{"words":1601,"minutes":9,"excerpt":"了解素材库的目的 素材库的目的是收集、管理和分类各种可用的设计素材，以便让它们在可用时可以轻松访问，以便在后续设计过程中快速使用。 素材库中的素材可以是矢量图形、照片、色彩组合、图标、字体或任何其他可复制并用于视觉设计的内容。素材库有助于减少重复劳动，提高效率，改善质量，并将重点放在创新设计上。 确定素材库的结构 一般..."},"design3":{"words":1204,"minutes":7,"excerpt":"在2022年这个时间点，有多款AI模型取得显著的进步。让我们可以借助AI来创作绘画、文章等内容，并衍生出AIGC行业。我尝试了市面上比较流行的Midjourney，记录体验和思考。 创作原理 使用生成式AI模型，根据用户输入的关键词，绘制关键词所描述的内容。目前，该类算法被使用在2D图像、音乐、文本内容等领域的创作中。..."},"design4":{"words":1511,"minutes":8,"excerpt":"大约半年前，我阅读了少楠老师的《产品沉思录》，了解了知识策展的概念，以及中文互联网上信息分布过于分散的问题。每个应用程序都是一个数据孤岛，要获取这些信息，我们必须在手机上安装所有的应用程序，才能进入这些孤岛，这样的体验极大地增加了我们获取信息的成本。在之前的文章中，我提到了需要控制个人的信息消费量，这样可以有效地减少我..."},"design5":{"words":1218,"minutes":7,"excerpt":"作为我一直使用的笔记工具，Notion曾经让我写下过许多使用体验文章。去年11月份，我重新整理成《Diary9 Notion笔记实践 2.0 》这篇文章。 今年 AI 功能的加入让我想补充一下最新的体验，它成为了我最佳的创作助手。 介绍Notion AI Notion AI基于GPT-3人工智能模型辅助处理文字的功能，..."},"design6":{"words":1006,"minutes":6,"excerpt":"😀 以三国地图为例子，给大家介绍下策略游戏的地图设计方法，主要包括原型搭建，地形细化，动线设计。 📝 原型搭建 基础规则 首先明确地图基础规则： 地图由格子组成，每个格子带有地形属性。部队单位可以在地图上移动。 通过像素计算移动像素/秒，设定基准速度，再根据基准速度微调各个兵种的速度。 山地地形不可通行，水域地形需..."},"design7":{"words":1219,"minutes":7,"excerpt":"前言 曾经在21年的时候，写过一篇《如何打造一个素材库》，讲诉了怎么使用Eagle这款软件搭建一个属于自己的素材灵感库，并在 2022 年的时候，把当时的最新想法理解进行了编辑，而在今年Eagle更新了4.0版本，使用的思路发生了大变动，索性重写一遍 软件介绍 Eagle 可以轻松收集及整理设计项目的“案例、灵感、截图..."},"design8":{"words":2021,"minutes":11,"excerpt":"前言 2023 年的一天，我在社交媒体上偶然看到了Airbnb联合创始人Brian Chesky发现迪士尼故事板的文章，恰好与我那时思考的故事范式命题契合，于是就收藏了下来。 在 2024 年的现在，打算继续探索好故事的范式，于是有了这篇记录文章 故事板介绍 “故事板”概念在 1930 年由迪士尼提出并使用，被广泛应用..."},"design9":{"words":637,"minutes":4,"excerpt":"前言 最近因为Brackeys的教程，同时也在做技术调研，就跟着教程把游戏原型给做了出来。 Github地址：（上传有问题，后续补充链接） 制作过程 节点Nodes 每个节点等于是游戏内的一个模块，也可以理解成一个小功能，例如：捡金币，整个逻辑可以单独用一个节点来实现，在金币节点下，可以捆绑动画，代码等内容 Playe..."},"diary1":{"words":421,"minutes":3,"excerpt":"one . 2021.10.23 最近忙着加班赶版本，并没有能好好陪身边的人。和女友过了3周年的纪念，今年还是随性的过，她带着我去了新地方，一起发现了一个超好吃的餐厅，互相喝酒吃个串，所有的烦恼和疲惫会随着欢笑而淡化 近期实在太忙了，在忙碌中抽出时间来陪伴家人朋友，并调整好自己的生活状态。包括自己身体状态，焦虑烦躁的情..."},"diary10":{"words":723,"minutes":4,"excerpt":"最近家里的房子装修好了，我的父亲希望能回去参加“入伙”仪式，临时买了机票，踏上回家之旅。 新屋记忆 “新屋入伙”习俗 广东地区有一些独特的新屋入伙习俗，以下是其中一些常见的习俗： 1. 开门红：在新屋入伙的当天，会在房屋门口贴上红纸或挂上红色的装饰物，象征着喜庆和吉祥。 2. 安床：新屋入伙后，会先摆放床铺。在摆放床铺..."},"diary11":{"words":1221,"minutes":7,"excerpt":"近期在整理notion，发现自己继承了印象笔记时期的收藏习惯，把在互联网上收集到的信息按照用途种类做了很多细致的划分，本质上是一条条等待整理的信息，他们之间并没有发生关联， 而信息的关联和整合，恰恰是AI时代获取信息的效率技巧。 思维误区 意识并察觉到这个问题，经过了一周的思考，发现自己还是陷入了思维的惯性。习惯性地按..."},"diary12":{"words":643,"minutes":4,"excerpt":"趁着最终季的更新，花了一天时间，一口气看完了《进击的巨人》 墙与谎言 语言是一种构建世界的工具，它构筑了艾伦的世界观，在安定的百年生活里，人们对巨人的恐惧，对墙的崇拜，对外面世界的无知，都是由语言构建的。 这个由语言构建的世界，在他的母亲死亡的瞬间被打破，他曾经希望踏出墙外，去看看外面的世界。但是命运永远不会以希望的样..."},"diary13":{"words":352,"minutes":2,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/x-pCAngjeOw?si=dI89CNeMDEJDZl89\" title=\"YouTube video player..."},"diary14":{"words":1133,"minutes":6,"excerpt":"不管以什么姿态度过这一年，都过去了。熬过那段艰难的时光，一切都还有变数！ 回归 在23年，遭遇了诸多变故，原以为是短暂的艰难，谁知道却是时代转折的钟声响起，我也不得不跟着时代的步伐，重新调整自己的生活。 我从上海搬回家乡，拥有充足的时间和家人、朋友相处。学习英语、锻炼身体、读书、认识新朋友，这些曾经都没有时间去做的事情..."},"diary15":{"words":895,"minutes":5,"excerpt":"在网络时代，浏览器已成为人们日常生活不可或缺的一部分。浏览器插件是一种能够为浏览器增加功能的软件，可以为用户提供更好的上网体验。在本文中，我将会介绍一些常用的浏览器插件。 --uBlock Origin uBlock Origin是一款轻量级的广告屏蔽插件，它可以自动屏蔽网页上的广告、跟踪器和恶意软件。该插件性能优秀，..."},"diary16":{"words":698,"minutes":4,"excerpt":"往年推荐： 1Password 密碼管理器 1Password 是一款流行的密码管理器，它帮助用户安全地存储和管理他们的密码、信用卡信息、网络账户、以及其他敏感数据。 Eagle for Chrome 此扩展程序可以轻松保存图像并将屏幕截图保存到 Eagle App。逛网站时看到感兴趣的图片就能立即收藏到 Eagle..."},"diary17":{"words":632,"minutes":4,"excerpt":"家门口有一条刚规划出来的路，因为不是主干道，车少，反而成为附近跑步的热门地点，在道路的两边总是能看到很多正在跑步的跑友，年纪从高中生到退休老者都有，每次看到都心痒痒。 调整一段时间生活作息，习惯了早睡早起的生活，但是体重一直没有掉下去，加上南方天气炎热， 身体代谢慢，导致胃口也不太好。想着靠运动来激活身体的代谢，最后选..."},"diary18":{"words":349,"minutes":2,"excerpt":"正视角 2D像素画风 像素郡物语/Pixelshire 正视角的模拟经营游戏，画风有点像早起塞尔达，风格比较简单复古。用的美术素材有点一般，没有太明显的特征。 林中小女巫 正视角的RPG游戏，场景的设计上比较贴合项目，细节景观设计比较亮眼有特色。 斜45度视角，2D像素画风 Yokai Inn 作为斜45度像素画风游戏..."},"diary19":{"words":425,"minutes":3,"excerpt":"缘起 最近的生活有些离群索居，时间大多花在生活和工作上。在工作之外，我最喜欢的就是读书和听播客，这种感觉就像小时候摆弄收音机，调频找电台节目一样，充满了乐趣。 自从不太喜欢逛社交媒体后，播客和RSS成为我获取信息的主要渠道。今年所有有价值的观点基本都是通过这两个渠道获得的。 这两个渠道的好处在于，它们能够提供非常细分领..."},"diary2":{"words":885,"minutes":5,"excerpt":"卷首 又是一年的忙碌期，在闲暇之余找出时间来写下这篇文章，问问自己到底想要什么？ 迈过30之后，感觉时间进入了2倍速，事情和人匆匆而来，又匆匆而去 时间太少是当下的焦虑，这都不算是个人的焦虑感，是整个行业的焦虑感 而这一切真的值得吗？ 创作和决策 今年开始思考一个命题，有办法在保持创作的过程中，减低焦虑感吗？更大程度增..."},"diary20":{"words":836,"minutes":5,"excerpt":"💡 有一个让你的文章更加易读的技巧：用口语写作。 曾经，我非常迷恋在文章中使用各种专业术语，甚至还加入了在互联网公司里沾染的“黑话”，觉得这是专业化的表现。但每次把文章写完给身边人看，他们总是感到困惑，需要我解释一遍才能理解。 现在想来，这是非常不明智的做法。过度追求“专业化”让文章阅读门槛过高，导致我的想法无法通过..."},"diary21":{"words":1122,"minutes":6,"excerpt":"误区 这几年，我一直陷入了一个思维陷阱：追求多而全的价值，什么都要最多最好的。如果达不到这个标准，就觉得不值得追求，总是把目标放在80-100的区间里。 之前做产品养成的一些完美主义习惯更是雪上加霜。在推进事情的过程中，我总是要求每个阶段的细节都做到尽善尽美，至少在表面上要光鲜亮丽。 但实际上，世界并不是这么运转的。在..."},"diary22":{"words":753,"minutes":4,"excerpt":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/0fD7XYkMzR0?si=7XuBeyP1oRL63XWK\" title=\"YouTube video player\" frameborder=\"0\" allow=\"acceler..."},"diary23":{"words":636,"minutes":4,"excerpt":"在这个炎热异常的夏天，你的离去是如此突然。母亲仍在不断念叨要来看你，然而还未等到她的到来，你已悄然离去。远在他乡的表妹因未能陪伴在你身边而深感愧疚，她只能通过反复观看你的视频来寄托哀思，泪流不止。 上周，我们为你庆生而聚。亲友们纷纷赶来看望你，我们都明白你年事已高，身体也在逐渐衰弱。大家心里明白，这可能是最后一次相聚，..."},"diary24":{"words":351,"minutes":2,"excerpt":"最近连绵不断的雨天，加上中途来几场台风，把我困在家里，待得有点难受了。恰逢周末的时候是晴天，走到楼下，坐在凳子上，享受下午温暖的阳光。 晴天的太阳能够很好地治愈低落的情绪，让阳光晒在后背上，暖暖的温度会让人的心情愉悦起来。 它好像我们期望中的幸福，总是显得稀缺，但是却充斥在我们的日常里。把脚步停下，当下的阳光就足够让人..."},"diary25":{"words":905,"minutes":5,"excerpt":"我选择追求简单的生活，享受着与亲朋好友相聚的时光，品味着美食的滋味，专注于自己真正重要的事情。 周期终结 2023年10月，我离开了生活7年多的上海，终于有机会从远处重新审视这座城市。从繁华的社会橱窗里走出来，回到成为自己的路上。 在此的生活戛然而止，就如命中注定一样，生活的巧合与心中的想法变得一致，都指向那个未知的方..."},"diary26":{"words":624,"minutes":4,"excerpt":"今年的整体感受：自由、平静和剧变，自己、家人、周遭社会都在剧烈变化。 主动和网络拉开距离，空出时间和空间去对内观察，产生了不少困惑，于是就看书做事去寻求解法。空闲下来，就出去散散步，在路上听着播客，让思绪随着主播的声音一起飘荡。 拆掉了许多概念，放弃了不少念想，可能性在丧失，但却不是坏事，也许它们本就不属于我。不断做事..."},"diary27":{"words":1039,"minutes":6,"excerpt":"前言 从 2024 年起，我便着手整理自己日常使用的软件。由于我已全面切换至苹果生态系统，所以这里推荐的软件大多适用于 web 和 mac 平台。若你需要适用于 windows 和安卓系统的软件，自行搜索便能找到。 近年来，AI 技术呈爆发式增长，对数据私有化以及便于 AI 调用等功能的需求愈发强烈，这也在很大程度上影..."},"diary28":{"words":2243,"minutes":12,"excerpt":"前言 从2015年起，我就开始和鼻炎这个小恶魔打交道了。十年来，我们之间上演了无数次\"你来我往\"的较量，我也在这个过程中摸索出了一些实用的应对之策。今天就把这些\"战斗经验\"分享给同样被鼻炎困扰的朋友们，希望能帮你少走些弯路。 说实话，鼻炎虽然算不上什么大病，但它那种反复骚扰的特性真的很让人抓狂。工作时突然一阵喷嚏，半夜..."},"diary29":{"words":496,"minutes":3,"excerpt":"前言 命运好像给我安排了新剧本，跟着感觉做了新的选择，又能有机会做自己喜欢的事，真的挺感恩的。 过程也是离奇波折，心态做了挣扎，现在终于是落入新轨道，写下这篇文章记录。 心态变化 最近感觉自己的心里的“我执”变少了，每天就想着怎么把自己照顾好，把该做的事情整理清楚。减少和自己无关的链接，简单的小生活回来了。 在修养期间..."},"diary3":{"words":600,"minutes":3,"excerpt":"2022年初，疫情还在肆虐，这场天灾持续了两年，它阻拦了我正常的生活，也改变了我的工作方式。让我重新开始思考，什么对自己来说更加重要。 在春节假期的间隙，我终于把身体和心灵的状态调整过来，尝试整理自己拍的照片，撰写更多的文章，删除博客里我觉得写得不好的文章。重新调整博客的定位，让文章的质量要求更提升一些。 使用UE引擎..."},"diary30":{"words":702,"minutes":4,"excerpt":"前言 博客重建后，我一直在调整网站细节。最初基于重度使用的 Notion 选择了 NotionNext，但感觉过于臃肿。因此，在去年底的时候我决定转向 Astro，把网站的加载速度和体验进行了优化。 切换到 Astro 时，我选择了 astro-gyoza 主题。其出色的性能让我深刻体验到了静态网站的极速优势。正好五一..."},"diary31":{"words":888,"minutes":5,"excerpt":"本站 RSS地址已更新，麻烦读者朋友们重新订阅一次哦！ 前言 时间总是无声地流淌，五一假期如约而至，整个人从忙碌的状态中渐渐放松下来，仿佛时间的齿轮也慢了几分。约了几顿饭局，一起喝茶，共饮几杯小酒，生活的实感在这些简单的相聚中悄然回归。 在街头的大排档和酒桌上，我们一起畅饮，一起分享，一起聊各自人生当下的困境和喜乐。..."},"diary32":{"words":564,"minutes":3,"excerpt":"本站 RSS地址已更新，麻烦读者朋友们重新订阅一次哦！ 前言 时光如白驹过隙，转眼间一个月就过去了。这段时间全身心投入公司项目，终于在节前圆满收尾。卸下工作重担后，整个人都轻松了许多，连睡眠都变得格外香甜。 假期伊始，我先好好补足了睡眠，然后开始潜心创作个人作品。通过不断制作demo来熟悉引擎，是最有效的学习方式。 开..."},"diary33":{"words":1511,"minutes":8,"excerpt":"前言 人的才能如同肌肉，需要持续锻炼才能成长。 在这个瞬息万变的时代，当新事物如潮水般涌来时，我们需要思考：以怎样的视角去审视，才能最大化地挖掘和运用这些新资源？我认为，成长型思维正是那把锋利的利器。它不仅能向外劈开固化思维的重重迷雾，更能向内深度雕琢我们的心智，让我们在变化中找到成长的力量。 什么是成长型思维？ 我第..."},"diary34":{"words":2543,"minutes":13,"excerpt":"前言 风会熄灭蜡烛，却能让火越烧越旺。 在这个充满不确定性的世界里，我们常常被教导要追求稳定、避免风险。但正如尼采的名言所说：\"杀不死我的，只会让我更坚强。\" 如果我告诉你，有一种思维方式不仅能让你在混乱中生存，还能让你从中获益，你会相信吗？这就是反脆弱性——一个能够彻底改变我们对待挫折和不确定性态度的强大概念。 在塔..."},"diary35":{"words":2269,"minutes":12,"excerpt":"前言 \"人生的意义，在于吃得好一点。\" 今天，我们失去了一位真正的生活艺术家。蔡澜先生的离世，让整个华语文化圈失去了一位独特的声音——那个总是用最朴实的语言，讲述最深刻人生道理的老顽童。他不仅仅是美食家、作家、电影人，更是一位生活的哲学家，用自己的方式诠释着什么叫做\"活得有趣\"。 在这个快节奏的时代，蔡澜先生始终保持着..."},"diary36":{"words":1533,"minutes":8,"excerpt":"睡眠不是时间的浪费，而是生命的投资。 被遗忘的生命密码 最近看到睡眠科学家Matthew Walker在TED的演讲，突然意识到一个令人震惊的事实：我们把生命的三分之一时间用来睡觉，却从未真正理解过它的深层意义。 在这个崇尚效率和产出的时代，睡眠被视为必要的恶，是阻碍我们\"成功\"的绊脚石。熬夜加班被当作勤奋的象征，早起..."},"diary37":{"words":1066,"minutes":6,"excerpt":"最近借由身边的一位朋友考入母校的契机，我得以重返母校，度过了一个下午的美好时光。 最陌生的熟悉 曾经烂熟于心的归途，如今却让人感到陌生疏离。打车回校的路上，那份久违的熟悉感已然消散无踪。虽然目的地依旧未变，但沿途的风景早已在时光的雕琢下悄然蜕变。 当车驶入那座熟悉的小镇，穿行于学校周边的街巷时，久违的亲切感如潮水般涌来..."},"diary38-life-on-the-road":{"words":630,"minutes":4,"excerpt":"最近的日子，在骑行与徒步之间找到了一种新的生活节奏，也在与老友的相聚中重拾了那些被忙碌掩埋的温暖时光。 久别重逢的老友 一位老友从上海飞来，我们已有两年没见面。我特意空出了整个晚上来陪他，一起去吃那家老街里的大排档，是我最喜欢的老店。 我们围坐一起，边吃边聊，就像从前一样。时间在欢笑中悄悄溜走，那些熟悉的感觉又回来了。..."},"diary39-back-to-billiards":{"words":485,"minutes":3,"excerpt":"最近的工作节奏异常紧张，生活中难免感到些许乏味和压力。某次在家附近和家人聊电话时候，看到了一家桌球室，最近便开始重新打起了桌球。 重拾桌球的乐趣 桌球离我家里并不远，每次就走路十分钟就到了。环境还不错，灯光柔和，空气流通。每次想打球的时候，就会瞬间下楼走过去。 今天中午饭吃得比较晚，到了晚饭时间，提前走到桌球室，叫了一..."},"diary40-cantonese-slang-culture":{"words":2661,"minutes":14,"excerpt":"粤语集：探索粤语文化的独特魅力，从语言到生活，记录岭南大地的风土人情。 很多人对粤语的第一印象是“难学”：声调多、语速快、连读多，听起来像一串节奏感很强的音符。但真正让粤语“活起来”的，往往不是发音本身，而是那些生动、鬼马、带着烟火气的俚语。 语言从来不只是工具，它也记录着一群人如何生活、如何相处、如何幽默，甚至如何“..."},"diary5":{"words":613,"minutes":4,"excerpt":"最近自己的工作暂停，忽然之间生活里拥有了许多自由分配时间，在每一天的24个小时里，自己开始认真思考，每一个小时应该怎么过。 生活突然间开始变得非常具体，从早上到晚上，把想做的事情记录到谷歌日历里。脑海中突然浮现的想法，把他们记录在Flomo里，然后把他们忘掉。 早上吃完早饭，泡上自己喜欢的咖啡，打开YouTube频道，..."},"diary6":{"words":551,"minutes":3,"excerpt":"粤语，俗称广东话，在粤语使用区中又称白话，是汉藏语系汉语族的一种声调语言，属于东南亚大陆语言区域，常用词中按不同方式计数有两成 、一百至两百个侗台语底层词，同时保留了一定的古汉语用词 离开广东五年，移居到上海，生活中越来越多地方系讲普通话，粤语嘅交流变得非常少。 所以喺近两年，我越来越感觉自己喺粤语表达方面退步紧。最近..."},"diary7":{"words":508,"minutes":3,"excerpt":"近来，由于疫情的原因，家里的台式机键盘坏掉了几个键，在输入时经常会被打断。新买的键盘无法送货，突然想起看过的一个节目，采访的人使用语音输入来写东西。 突然想起家里有女友送的麦克风，于是我把压箱底的麦克风找出来，然后下载了输入法，折腾了一套简单的语音输入环境。经过了两天的使用，摸索出一些经验。 关闭输入法的符号自动补充，..."},"diary8":{"words":2355,"minutes":12,"excerpt":"作为一个生长在祖国南方的孩子，我家里特别喜欢在吃饭时放CCTV新闻，而北京这座城市的点点滴滴会在这个时候被我所了解，一直以来让我对它产生很多的好奇，总是希望能有一天能够去看看。 在2018年的时候，项目的停滞让我有了一个短暂的假期。心里想着，要不去趟北京？想去看北京城内的故宫、圆明园等等古代建筑。 我的第一站来到故宫参..."},"diary9":{"words":952,"minutes":5,"excerpt":"印象笔记作为多年笔记和素材的搜集工具，早已臃肿不堪，树状的分类在知识的结构演化上，总是觉得内容链接得不够紧密，无法有效形成知识区，这成为了我选择Notion的契机。 基于对网页工具发展的判断，测试了多款市面上的笔记软件，最终选中了Notion。核心的“块”思路，和设计软件中组件化思路一致，需要处理的事情，就变成把笔记内..."},"en1-yanni-el-morro-2011":{"words":1191,"minutes":6,"excerpt":"音乐无界：记录那些超越语言与地域的旋律，聆听世界的心跳与共鸣。 当希腊作曲家雅尼（Yanni）在波多黎各圣胡安的莫罗城堡（El Morro）架起琴台，历史的厚重与音乐的纯粹在这座有着 500 年历史的堡垒中交织。这场 2011 年的现场音乐会不仅是一次视听盛宴，更是一次文化的对话——在加勒比海的波涛声中，在古堡的城墙之..."},"hk1":{"words":942,"minutes":5,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 开篇 想写这篇文章，也是在《世界真细小》歌曲出来之后，想谈谈C.Y.KONG，这是我个人最喜欢的香港音乐人之一。 介绍：C.Y. Kong，谐音：思歪江，是香港音乐人江志仁的笔名。他还有一个马甲叫做山本洋太。主要从事作曲、编曲与监制..."},"hk10":{"words":713,"minutes":4,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 刘惜君跟林晓峰合唱的《现代爱情故事》全场最佳，不得不说林晓峰的声音实在太有杀伤力了，尤其唱低音，不仅音色好听，而且情感真挚。其实这也是一种天赋，刘惜君的声音一直是她最大的杀伤力，不仅有极高的辨识度，而且非常好听，更绝的是没人能..."},"hk11":{"words":306,"minutes":2,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 以\"1974-2024港乐50年\"为脉络，集结港澳内地歌手，通过经典回顾与创新演绎，这是一次性的合集，总长 1个多小时，可以作为背景音乐。 <iframe width=\"750\" height=\"420\" src=\"https..."},"hk12":{"words":1138,"minutes":6,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在某个瞬间，我们会觉得失去了许多，有深爱的地方，有深爱的事物，还有一个，又一个心爱的人。当生活的重担压得我们喘不过气，当黑暗似乎要吞噬一切希望时，音乐成了我们心灵的避风港。 这首粤语版的《曾经我也想过一了百了》，用最温柔的方式..."},"hk13":{"words":823,"minutes":5,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在爱情的世界里，我们都曾经历过这样的时刻：明明是最重要的人，却只能以\"嘉宾\"的身份出现在对方的人生重要时刻。那种距离感，那种疏离感，比任何言语都要来得残酷。 但正是这种遗憾，让爱情变得更加珍贵。正是这种距离，让思念变得更加深刻..."},"hk14":{"words":1493,"minutes":8,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在华语乐坛的演唱会历史上，有些演出会成为一代人的集体回忆。2010年陈奕迅在香港红馆举办的DUO演唱会，无疑就是这样一场经典。这场演唱会不仅打破了陈奕迅个人在红馆的演出纪录，连开十八场，更以其独特的「DUO 双面」主题，在歌曲..."},"hk15":{"words":873,"minutes":5,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在华语乐坛的众多经典作品中，有些歌曲能够瞬间击中人心最柔软的地方。2014年，张敬轩推出的《青春常驻》正是这样一首作品。这首由黄伟文填词、张敬轩与Johnny Yim共同作曲的歌曲，不仅成为了张敬轩转投英皇娱乐后的首张专辑《M..."},"hk16-lemon-cantonese":{"words":936,"minutes":5,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 有些歌曲能够穿越语言的界限，直抵人心最柔软的角落。米津玄师的《Lemon》本就是一首充满治愈力量的经典之作，而当它遇上粤语的温润韵律，便诞生了这个令人惊艳的版本。 \"不是词神\"用心重新填词，将原曲的深情与粤语的韵味完美融合，更巧妙地..."},"hk17-ruyuan-cantonese":{"words":1034,"minutes":6,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 有些歌曲能够承载时代的重量，传递民族的情感。《如愿》本就是一首充满家国情怀的经典之作，而当它遇上粤语的温润韵律，便诞生了这个令人动容的版本。 \"不是词神\"与糖糖YuzeTang用心演绎，将原曲的深情与粤语的韵味完美融合，更巧妙地融入..."},"hk18-wuchang-hk-fire":{"words":620,"minutes":4,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 2025年12月，香港发生了令人心痛的大火事件，举世震惊。 \"不是词神\"与心姐在得知这一消息后，决定用音乐为香港同胞送上一份心意。正如创作者所言：\"这样巨大的伤痛，想抚平，实在太难了。但是或许我们可以用一首歌，一份心意，以及一个拥抱..."},"hk19-kiri-t-outrageous-thing-cover":{"words":830,"minutes":5,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 有些歌一开口，就像把你拽回某个“还愿意乱来”的年纪：心跳比理智更快，犹豫比冲动更慢。 《至少做一件离谱的事》就是这样一首作品——它不鼓励莽撞，却很认真地替我们把那句埋在胸口很久的话说出来：人生这么长，总要为了自己，试一次“不那么像自..."},"hk2":{"words":619,"minutes":4,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 最近在《乘风破浪的姐姐3》里面看到薛凯琪，她是我最喜欢的粤语女歌手之一，她被喻为香港最后的甜妹，她的性格也是古灵精怪，讨人喜欢。 --《奇诺里维斯的回信》 当年在港台歌坛里，曾经流行过一段把歌词写成一个小片段的话剧。这首歌也是典型的..."},"hk3":{"words":793,"minutes":4,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 麦浚龙，在整个香港乐坛里，算是特立独行的歌手之一。因家世较好，初期发展上反而成为了阻碍，甚至上台表演时遭观众喝倒彩。04年加入新公司后，做歌的曲风和调性都往独立音乐领域去探索，他的歌里面有很多特立独行的故事 ON.002 忆起 十年..."},"hk4":{"words":881,"minutes":5,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在香港乐坛的璀璨星河中，杨千嬅如同一颗独特的明星，以她爽朗的笑声和真挚的歌声照亮了无数人的青春岁月。从阳光少女到成熟女性，她的音乐之旅不仅记录了自己的成长，也陪伴着我们走过人生的喜怒哀乐。 她与黄伟文的创作组合堪称绝配，从《野..."},"hk5":{"words":662,"minutes":4,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在成长的旅途中，我们总会经历从依赖到独立的蜕变。香港南区少年儿童合唱团翻唱的《幼稚园》，以纯净的童声演绎了这首原本由Twins演唱的经典之作。 黄伟文的词作如同一面镜子，映照出我们每个人心中那个不愿长大的小孩。当稚嫩的童声唱起..."},"hk6":{"words":569,"minutes":3,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 <iframe width=\"750\" height=\"420\" src=\"https://www.youtube.com/embed/7cW2NlDlyWg?si=73yrK14r3eS7Z8X7\" title=\"YouTube..."},"hk7":{"words":2096,"minutes":11,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在城市的午夜，当霓虹灯渐次熄灭，林夕的词与陈奕迅的声音在耳机里交织成一剂失恋解药。 这三部曲如同三个时空胶囊，封存着都市人情感的三种状态：《人来人往》里的现实撕裂，《明年今日》中的时间延展，以及《富士山下》的哲学超脱。当这位词..."},"hk8":{"words":754,"minutes":4,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 在经历了许多人生的不确定，我们常常发现世界并非如我们所愿。计划被打乱，梦想被搁置，期待落空成了家常便饭。每个人都曾面对过这样的时刻：当你满怀期待地推开一扇门，却发现门后的风景与想象中截然不同。这种落差感，这种无力感，有时会让人..."},"hk9":{"words":1230,"minutes":7,"excerpt":"港乐集：细数那些光影交织的粤语歌年代，记录心中难忘的旋律，分享或流行或小众的港乐故事。 前言 当陈慧娴的歌声响起，时光仿佛倒流回那个港乐辉煌的年代。《千千阙歌》与《夕阳之歌》这两首同曲异词的经典，恰如人生的一体两面：前者是离别时珍藏美好的深情告白，后者则是阅尽沧桑后的人生独白。在《声生不息-大湾区》的舞台上，陈慧娴用她..."},"hua1":{"words":592,"minutes":3,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 陈绮贞，一个用吉他和歌声织就诗意的创作歌手。在独立音乐圈里，她就像是一位温柔的诗人，用简单的文字，唱出生活中最细腻的感动。 --《旅行的意义》 这首歌让许多人爱上了陈绮贞。\"我喜欢看着你发呆，想象你在想什么\"，简单的歌词道出了爱情最纯粹的模样。这首歌不仅是..."},"hua10-rainbow-chamber-singers":{"words":2262,"minutes":12,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与歌词。 开篇 彩虹合唱团的作品中,没有高高在上的说教,只有平等的对话与温柔的陪伴。他们理解加班族的疲惫,理解年轻人的焦虑,理解每一个在生活中挣扎的普通人。 他们唱的是\"找钥匙\"\"加班累\"\"过年被催婚\"——这些再普通不过的生活片段。 生活很难,但彩虹合唱团用幽默告诉..."},"hua2":{"words":559,"minutes":3,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 王菲首次负责专辑封面概念，并第一次执笔谱写了她第一首国语歌〈执迷不悔〉的歌词，此歌成为她音乐生涯最知名的代表作之一！ <iframe src=\"//player.bilibili.com/player.html?isOutside=true&aid=332..."},"hua3":{"words":560,"minutes":3,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 安溥是我很喜欢的歌手，她对生活和歌曲的诠释，在年少的时刻影响了我很多。最近偶然间，我在 YouTube 上看到了她这首《關於我愛你》的视频，我觉得非常有感触，于是决定分享给大家。 年少的我对这首歌词的理解是对恋人的眷恋，而现在我却觉得是对自己的眷恋。 <i..."},"hua4":{"words":988,"minutes":5,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 王心凌，那个陪伴了无数人青春岁月的甜心教主。《我会好好的》这首歌发布于2004年，收录在专辑《Cyndi Begin》中，是她早期的代表作之一。这首歌以其温柔的旋律和真挚的情感，成为了许多人心中关于青春和成长的美好回忆。 时隔多年再听这首歌，那种淡淡的忧伤..."},"hua5":{"words":718,"minutes":4,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 有些歌曲能够直击人心，伍佰的《被动》便是如此。 \"爱你越久我越被动\"——这句歌词道出了爱情中最真实的矛盾。当我们面对真正深爱的人时，往往会因为太过珍惜而变得小心翼翼，选择退缩而非主动。 伍佰标志性的沙哑嗓音为这首歌增添了独特质感，每一个音符都带着岁月痕迹，..."},"hua6-lin-junjie-jiaohuan-yusheng-mv":{"words":831,"minutes":5,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与词句。 《交换余生》是林俊杰在近年里最打动我的作品之一。作为一首情感陈述的歌曲，它并不急于宣泄，而是用细腻的旋律与克制的表达，带你慢慢走进“余生”这一命题：当现实与理想交错，我们如何在爱里做出选择？ 官方 MV 邀请阮经天出演，以近景的情绪铺陈和冷暖光影的对比，呈..."},"hua7-liang-jingru-manleng-mv":{"words":815,"minutes":5,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与歌词。 初听《慢冷》，是被那份“克制的温柔”吸引：它不像即时爆发的情歌，而是在时间的缓慢流动中，把热烈收进心里，让情绪与故事一点点升温。梁静茹的声线依旧温软，却在收放之间更显成熟，像是在为所有需要自愈的人留下一段可供栖居的旋律。 这支官方 MV 用“从冷到暖”的色..."},"hua8-yang-naiwen-tuikai-shijie-de-men-mv":{"words":1095,"minutes":6,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与歌词。 初听《推开世界的门》，会被它像清风一样的旋律与不疾不徐的叙述吸引：没有喧嚣的堆叠，却把力量藏在温柔里。歌词像与年少的自己对话，提醒我们在“这个世界的脚步太快了”的当下，依然要保留属于自己的温度与节奏（见 Bilibili 投稿页的节目文案，提到“这个世界的..."},"hua9-wang-xinling-daming":{"words":1026,"minutes":6,"excerpt":"华语集：记录那些陪伴成长的华语音乐，分享打动内心的旋律与歌词。 初听王心凌的《大眠》，如同在半梦半醒中慢慢清醒——歌曲没有急促的节奏，却以层叠的音色与细腻的编排，逐步引领你进入一个关于遗忘、反思与救赎的心理空间。与王心凌过往作品中那份灵动与活力不同，《大眠》展现了她更深层的音乐探索：在低沉而富有磁性的嗓音中，装下了对成..."},"others1":{"words":793,"minutes":4,"excerpt":"推荐一本书《自尊的六大支柱》，这本书年代有点久远。 作者：极乐 链接：https://www.zhihu.com/question/26522277/answer/133530231 来源：知乎 著作权归作者所有，转载请联系作者获得授权。 本站 RSS地址已更新，麻烦读者朋友们重新订阅一次喔！ --💡 感谢您的观看！..."},"others10-inner-peace":{"words":2250,"minutes":12,"excerpt":"前言 在这个信息爆炸、节奏飞快的时代，我们每个人都可能像故事中的马可一样，抱着一颗不安的心在生活里四处奔跑。人容易被过去的阴影拖拽，被未来的未知撩拨，像在风暴中心兜圈子般，明明身在当下，却把注意力分散在无数的可能与假设里。我们习惯把平静与智慧寄托在遥不可及的地方，仿佛只有走进深山的清风、离开如今的喧嚣，才能找回心灵的安..."},"others11-expectation-effect":{"words":2224,"minutes":12,"excerpt":"前言 在人生的道路上，有一种无形的力量能够悄然改变我们的命运。它不需要魔法，也无需超能力，它就隐藏在我们看待世界与他人的方式里，藏在我们对自己和他人发出的那一句\"我相信你\"的背后。当你听见\"你一定可以\"时，是否感到心里涌起一股不易察觉却实实在在的能量？这就是期望效应的魅力——一种被心理学反复证明、能够改变行为与结果的朴..."},"others12-small-steps-never-stop":{"words":1086,"minutes":6,"excerpt":"我们常以为：只要想得足够清楚、说得足够激动人心，行动就会自然而然发生。但这期视频给了我一个更扎心、也更有效的答案：别急着燃，先动起来。 视频链接：<https://www.bilibili.com/video/BV1nUqWBtELN/这个视频真正戳中的点 视频的标题叫《改善之道：每天只做一点点，但永不停止》。它用一个..."},"others13-stoicism-introduction":{"words":2586,"minutes":13,"excerpt":"摘要：斯多葛主义（Stoicism）形成于希腊化时期并在罗马时代得到扩展，通常以“逻辑—自然—伦理”的整体结构呈现，其中伦理学与实践训练（askēsis）在文本传统中尤为突出。本文在不预设具体形而上学立场的前提下，聚焦其两项核心规范性主张：其一，通过“可控/不可控”的区分将伦理评价重心由外在结果转向意向与选择；其二，以..."},"others14-sdl-3-4-bilibili-intro":{"words":1561,"minutes":8,"excerpt":"有些技术更新，第一次看到标题会觉得“又是小版本迭代”；但点开看完才发现，它解决的都是日常开发里最磨人的那类问题：依赖、兼容、以及“为什么这台机器能跑那台不能”。 最近我刷到一支关于 SDL 3.4 的解读视频（8 分钟左右），节奏很快，但信息密度也很高。更难得的是，它没有停在“功能清单”这一层，而是把这些变化会怎么影响..."},"others2":{"words":626,"minutes":4,"excerpt":"💡 感谢您的观看！欢迎分享文章，或是来信与我交流。"},"others3":{"words":548,"minutes":3,"excerpt":"💡 感谢您的观看！欢迎分享文章，或是来信与我交流。"},"others4":{"words":18989,"minutes":95,"excerpt":"💡 感谢您的观看！欢迎分享文章，或是来信与我交流。"},"others5":{"words":5729,"minutes":29,"excerpt":"文字稿 [applause] Thank you. [掌声] 谢谢。 [applause] I'm honored to be with you today for your commencement from one of the finest universities in the world. [掌声] 今天，能..."},"others6":{"words":1072,"minutes":6,"excerpt":"文字稿 As I began to love myself I found that anguish and emotional suffering are only warning signs that I was living against my own truth. Today, I know, this is..."},"others7":{"words":1150,"minutes":6,"excerpt":"前言 在视频游戏开发中，游戏循环是游戏引擎的核心部分。它负责协调和管理游戏的各个方面，包括画面渲染、用户输入处理、物理模拟和人工智能等。本文将详细介绍游戏循环的概念、它在游戏开发中的重要性，以及如何设计一个高效的游戏循环。 游戏循环的重要性 游戏循环是游戏引擎的命脉，直接影响游戏的性能和玩家的体验。一个设计出色的游戏循..."},"others8":{"words":3240,"minutes":17,"excerpt":"等距游戏起源于 20 世纪 70 年代末和 80 年代初。从那时起，它们被用于各种类型的游戏，如策略游戏、模拟游戏、角色扮演游戏和益智游戏。如今，等距游戏仍然被独立开发者和 AAA 工作室开发。等距游戏提供独特的视觉风格和游戏玩法可能性。 在本文中，我将简要介绍等距投影和等距游戏，然后我们将深入探讨如何使用 Godot..."},"others9":{"words":1684,"minutes":9,"excerpt":"对于每一个热爱游戏设计的人来说，Game Maker's Toolkit 都是不可错过的学习宝库。 Game Maker's Toolkit：游戏设计的深度解析频道 1. 什么是 Game Maker's Toolkit？ Game Maker's Toolkit（简称 GMTK）是 YouTube 上最受欢迎的游戏设..."},"think01":{"words":589,"minutes":3,"excerpt":"近期发生了一件有趣的事情，一直在玩的异星工厂存档，因为里面煤炭资源枯竭而导致发电系统的崩溃，而我在玩时候技术选择太激进，把武器、运输等等零件都换成电力驱动的，这一下子彻底趴窝了。而这时候，虫族的大部队冲了过来，这就形成了一个我必须在虫族来临前解决问题的场景。 最搞笑的事情是，最近一次的手动存档是在10分钟前，其他都是自..."},"think02":{"words":1177,"minutes":6,"excerpt":"自从GPT-3.5爆发以来，短短一年多的时间，大模型的应用从极客圈扩展到更广泛的人群。从我的切身体验来看，技术的应用范围逐渐拓宽，越来越多的设备和应用开始在细节上体现出这些技术的融合。 变化的领域 翻译 最直观的变化体现在翻译领域。从视频字幕、多语言书籍翻译到音频和视频内容，语言的障碍几乎消失。 开发者们也热衷于推出各..."},"think03":{"words":1184,"minutes":6,"excerpt":"前言 在信息洪流的时代，我们不断收集知识碎片，却常常发现笔记越积越多，而真正的洞见却越来越少。各类笔记工具和方法论层出不穷，但它们大多关注如何更有效地\"存储\"信息，却很少思考一个根本问题：笔记的本质究竟是什么？ 从静态仓库到生态养分 我们习惯把笔记当作知识仓库，只是单纯存放信息碎片。但换个角度看，如果把笔记变成思想生态..."},"think04-feynman-learning-technique":{"words":2124,"minutes":11,"excerpt":"费曼学习法（Feynman Learning Technique）是由诺贝尔物理学奖得主理查德·费曼（Richard Feynman）所提倡的一种学习方法。它的核心理念朴素而有力：如果你不能用简单的语言解释一个概念，说明你还没有真正理解它。用简单的语言并不是在“降低难度”，而是在逼迫自己直面知识的骨架与逻辑，把术语与包..."},"think05-habit-breaking-myth":{"words":1279,"minutes":7,"excerpt":"关于如何改变生活中的坏习惯，很多人都尝试过依靠意志力来戒掉它们。但科学研究告诉我们，这个方法其实从一开始就注定要失败。 我们被习惯操控的程度 你是否曾想过，我们每天有多少行为是在无意识状态下进行的？科学家的研究结果可能会让你吃惊： 我们每天近一半的行为都是习惯在操控！ 这意味着，即使你认为自己在进行有意识的决策，其实有..."},"wen-1":{"words":842,"minutes":5,"excerpt":"这首英诗是我在看《我董你》采访周玉琴小姐所知道的，上网搜索了一下，《三感》Blog上翻译的版本不错，借此与诸位分享。 <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ryIsDgj7OXg?si=GPCCsJo-vWuZzmx\" t..."},"wen-2":{"words":369,"minutes":2,"excerpt":"<iframe width=\"750\" height=\"420\" src=\"//player.bilibili.com/player.html?isOutside=true&bvid=BV1Sy4y1e7Ub&p=1&autoplay=0\" scrolling=\"no\" border=\"0\" frameborder=\"..."},"wen-3":{"words":484,"minutes":3,"excerpt":"<iframe width=\"750\" height=\"420\" src=\"//player.bilibili.com/player.html?isOutside=true&bvid=BV1Ai4y1F7NE&p=1&autoplay=0\" scrolling=\"no\" border=\"0\" frameborder=\"..."},"wen-4":{"words":448,"minutes":3,"excerpt":"<iframe width=\"750\" height=\"420\" src=\"//player.bilibili.com/player.html?isOutside=true&bvid=BV1ni4y1b7f9&p=1&autoplay=0\" scrolling=\"no\" border=\"0\" frameborder=\"..."},"wen-5":{"words":293,"minutes":2,"excerpt":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/pXFrdV3Vd5k?si=gBlTaVHW9m7GLSzc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"acceler..."},"wen-6":{"words":1254,"minutes":7,"excerpt":"成为一个自爱的人，学会自我肯定、自我接纳、自我愉悦，是一道人生要做的功课。 人的大脑分为理智和情感，如果人的情感是一头大象，那么理智就是骑在背上的人。每做一次改变，就是一次驱使大象往前走的动作，而大象的脾气有三个特点：力气大、受情感激发、受已有经验的支配。第三点我们可以干预，另外两点很难，只能安抚。 所以改变的本质就是..."}}